---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.TextTypeId
source: html/f1a07a50-278a-7db0-5e19-13a076226b9a.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.TextTypeId Property

Element id of text associated with legend body.

## Syntax (C#)
```csharp
public ElementId TextTypeId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null